app/views/storylines/index.html.erb

SELECT "pictures".* FROM "pictures" ORDER BY "pictures"."id" DESC LIMIT 1
---
	<div id="new_drawings">
		<% if Picture.last %>