app/controllers/phrases_controller.rb

INSERT INTO "phrases" ("created_at", "storyline_id", "text", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 29 Dec 2013 01:24:55 UTC +00:00], ["storyline_id", 25], ["text", "hi have a sammie"], ["updated_at", Sun, 29 Dec 2013 01:24:55 UTC +00:00], ["user_id", nil]]
INSERT INTO "storylines" ("created_at", "phrase_id", "picture_id", "turn", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 24 Dec 2013 01:52:57 UTC +00:00], ["phrase_id", 47], ["picture_id", nil], ["turn", 2], ["updated_at", Tue, 24 Dec 2013 01:52:57 UTC +00:00], ["user_id", nil]]
SELECT "turns".* FROM "turns" ORDER BY "turns"."id" DESC LIMIT 1
UPDATE "turns" SET "turn_number" = 3, "updated_at" = '2013-12-29 00:45:54.648721' WHERE "turns"."id" = 4
---
  def create
    puts "**************"
    puts "in phrase create"
    puts params[:text]
    puts params[:storyline_id]
    puts params
    puts "**************"

  	@phrase = Phrase.new(params[:phrase])
  	@phrase.text = params[:text]
    @phrase.storyline_id = params[:storyline_id]
    @phrase.save!

    # this needs to happen here for now but there might be a better place
    #Turn.where(turn_number: @storyline.turn).first ? @turn = Turn.where(turn_number: @storyline.turn).first). : @turn.create = 1
    @turn = Turn.last
    @turn.turn_number += 1
    @turn.save!