app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("created_at", "image", "storyline_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 30 Dec 2013 00:21:27 UTC +00:00], ["image", nil], ["storyline_id", nil], ["updated_at", Mon, 30 Dec 2013 00:21:27 UTC +00:00], ["user_id", nil]]
SELECT "turns".* FROM "turns" ORDER BY "turns"."id" DESC LIMIT 1
UPDATE "turns" SET "turn_number" = 3, "updated_at" = '2013-12-30 00:30:15.494144' WHERE "turns"."id" = 12
---
  def create
    puts "**************"
    puts "in pictures create"
    puts "**************"
    @picture = Picture.new(params[:picture])
    @picture.image = params[:image]
    @picture.storyline_id = params[:storyline_id]
    @picture.save!
    # this needs to happen here for now but there might be a better place
    #Turn.where(turn_number: @storyline.turn).first ? @turn = Turn.where(turn_number: @storyline.turn).first). : @turn.create = 1
    @turn = Turn.last
    @turn.turn_number += 1
    @turn.save!

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "create"]]
---
  def show
  	@picture = Picture.find(params[:id])