app/controllers/players_controller.rb

INSERT INTO "players" ("created_at", "email", "name", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 29 Dec 2013 06:44:39 UTC +00:00], ["email", nil], ["name", nil], ["phone_number", nil], ["updated_at", Sun, 29 Dec 2013 06:44:39 UTC +00:00]]
---
  def create
    puts "*"*50
    puts "in players create"
    puts "*"*50
    @player = Player.create(params[:player])