app/controllers/sessions_controller.rb

INSERT INTO "turns" ("created_at", "turn_number", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 11 Dec 2013 01:38:34 UTC +00:00], ["turn_number", 1], ["updated_at", Wed, 11 Dec 2013 01:38:34 UTC +00:00], ["user_id", 1]]
INSERT INTO "users" ("created_at", "name", "oauth_expires_at", "oauth_token", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	user = User.from_omniauth(env["omniauth.auth"])
  	session[:user_id] = user.id
  	redirect_to root_url

  	# add the turn here once Facebook auth working
  	@turn = Turn.create(turn_number: 1, user_id: user.id)