app/controllers/storylines_controller.rb

  def index
  	@storylines = Storyline.all
    # need a way to signal storyline is complete
    # use a timestamp and set a boolean?
    # turn this on later for now, too annoying to reset each time
    #@active_or_new = Storyline.last.active
    #@active_or_new ? @storyline = Storyline.last : @storyline = Storyline.new
    @active_or_new = false
    @storyline = Storyline.last
    @turn = Turn.last.turn_number
---
SELECT "turns".* FROM "turns" ORDER BY "turns"."id" DESC LIMIT 1

  def show
  	@storyline = Storyline.find(params[:id])
---
SELECT "storylines".* FROM "storylines" WHERE "storylines"."id" = $1 LIMIT 1  [["id", "2"]]