app/controllers/storylines_controller.rb

SELECT "storylines".* FROM "storylines" ORDER BY "storylines"."id" DESC LIMIT 1
---
  def index
  	@storylines = Storyline.all

SELECT "storylines".* FROM "storylines" LIMIT 1
SELECT "turns".* FROM "turns" ORDER BY "turns"."id" DESC LIMIT 1
INSERT INTO "storylines" ("active", "created_at", "story_name", "time_stop", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["active", nil], ["created_at", Sun, 05 Jan 2014 04:55:18 UTC +00:00], ["story_name", nil], ["time_stop", nil], ["updated_at", Sun, 05 Jan 2014 04:55:18 UTC +00:00], ["user_id", nil]]
INSERT INTO "turns" ("created_at", "turn_number", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 29 Dec 2013 07:05:13 UTC +00:00], ["turn_number", 1], ["updated_at", Sun, 29 Dec 2013 07:05:13 UTC +00:00], ["user_id", 2]]
UPDATE "storylines" SET "time_stop" = '2013-12-29 07:23:02.525249', "active" = 't', "updated_at" = '2013-12-29 07:18:02.538978' WHERE "storylines"."id" = 30
---
  def create
  	# need to add all the pictures & phrases before
  	# creating and saving the storyline
    puts "**************"
    puts "in storyline controller"
    puts "**************"
  	#@storyline = Storyline.new(params[:storyline])
    @storyline = Storyline.includes(phrases: :phrase_id).first

    #@project = Project.includes(tasks: :logs).first

    # @picture = Picture.new(params[:picture])
    # @phrase = Phrase.new(params[:phrase])
    # @storyline.picture_id = @picture.id
    # @storyline.phrase_id = @phrase.id
    @turn = Turn.last.turn_number
    @storyline.turn = @turn
  	@storyline.save()